#define _CRT_SECURE_NO_WARNINGS 1
#include<stdio.h>
#include<math.h>

//写一个代码,打印100~200之间的素数
//素数-质数
//只能被1和他本身整除

//代码优化1：
//m=a*b;
//a和b中一定至少有一个数字是 <=开平方m的
//16 = 2*8 = 4*4
//所以，大于开平方m的就不需要判断是否为m的因子，减少循环执行次数

//sqrt用于计算开平方的函数 -需要用到库函数 math.h
//减少了循环的执行次数

//代码优化2：
//偶数不可能是素数
//修改for (i = 100; i <= 200; i ++)为for (i = 101; i <= 200; i += 2)

int main0011_2()
{
	int i, j = 0;

	//判断i是不是质数
	for (i = 101; i <= 200; i += 2)
	{
		int flag = 1;//定义一个参数，检测i是否能被 除了1和它本身的数 整除

		for (j = 2; j <= sqrt(i); j++)
		{
			if (i % j == 0)
			{
				flag = 0;//如果能被2到i-1之间的整除，记录flag=0;
				//break;
			}
		}

		if (flag == 1)//不能被2到i-1之间的数整除
		{
			printf("%d是质数\n", i);//那么i就是质数
		}
	}
	return 0;
}