#include<iostream>
using namespace std;

//一维数组定义的三种方式:
/*	数据类型 数组名[ 数据长度 ]
	数据类型 数组名[ 数组长度 ] = { 值1, 值2 ...};
	数据类型 数组名[ ] = { 值1, 值2 ...};
*/

//数组特点:放在一块连续的内存空间中，数组中每个元素都是相同的数据类型
int main1()
{
	//1.数据类型 数组名[ 数组长度 ];
	int arr[5];

	//给数组中的元素进行赋值
	//数组元素的下标是从0开始索引的
	arr[0] = 10;
	arr[1] = 20;
	arr[2] = 30;
	arr[3] = 40;
	arr[4] = 50;

	//访问数据元素
	cout << arr[0] << endl;
	cout << arr[1] << endl;
	cout << arr[2] << endl;
	cout << arr[3] << endl;
	cout << arr[4] << endl;

	//2.数据类型 数组名[ 数组长度 ] = { 值1, 值2 ...};
	int arr2[5] = { 10,20,30,40,50 }; //如果在初始化数据时数据不全，程序会用0来填补剩余的数据

	//访问数据元素
	cout << arr2[0] << endl;
	cout << arr2[1] << endl;
	cout << arr2[2] << endl;
	cout << arr2[3] << endl;
	cout << arr2[4] << endl;

	//利用循环 输出数组中的元素
	for (int i = 0; i < 5; i++)
	{
		cout << arr2[i] << endl;
	}

	//3. 数据类型 数组名[ ] = { 值1, 值2 ...};
	//定义数组的时候，必须有初始长度
	int arr3[] = { 10,20,30,40,50 };//输入一定数量元素，就有对应数量的长度

	system("pause");
	return(0);
}
//总结1: 数组的命名规范与变量命名规范一致，不要和变量重名
//总结2：数组中下标是从0开始索引